Repository: dans-art/add-customer-for-woocommerce
Catalog: languages/stable-readme-*.po
Languages: de_de

source: Adds a new checkbox to the orders page to add a new customer/user. It creates a new user, based on the billing data. If no e-mail is provided, it will &hellip;
de_de: Fügt auf der Bestellseite ein neues Kontrollkästchen hinzu, um einen neuen Kunden / Benutzer hinzuzufügen. Es erstellt einen neuen Benutzer basierend auf den Rechnungsdaten.

source: Add Customer for WooCommerce
de_de: WooCommerce - Kunde hinzufügen

source: Does the new user get a notification of the created account? - No, not per default. It can be enabled on the settings page. The Email will send the login credentials including a random password to the customer.
de_de: Bekommt der neue Nutzer eine Benachrichtigung zum neuen Konto? - Nein, nicht standartmässig. In den Einstellungen kann dies aktiviert werden. Es wird dann eine Email mit den Login Informationen inklusive Passwort an den Kunden gesendet.

source: What happens, if an email already exists? - There will be no new user created. The plugin will assign the order to the existing customer.
de_de: Was passiert, wenn eine Email bereits existiert? - In diesem Fall wird kein neuer Kunde generiert. Das Plugin verbindet die Bestellung mit dem existierenden Kunden.

source: What role the new user will have? - Customer
de_de: Welche Rolle wird der neue Kunde haben? - Kunde

source: Required Plugins: WooCommerce 4.7.0 or higher
de_de: Benötigte Plugins: WooCommerce 4.7.0 oder neuer

source: Settings Menu: Settings -&gt; Add Customer Settings
de_de: Einstellungsmenu: Einstellungen -> Kunde hinzufügen

source: This Plugin is designed to help you to create new users/customers with ease. Especially useful if the client is ordering via phone or email and you like to take advantage of the stock- and order management in WooCommerce. It adds a simple checkbox at the end of the billing address. If the box is checked, it will create a new user with the role "customer". If no e-mail is provided, it will create a unique one for you. It uses your site’s domain as the domain part and the name as the name part. E.g. firstname.lastname@your-site.com. By default, the newly created user will not get any emails while creating the account. But he will eventually on order change. In the settings menu, there are options for checking the box by default and send login credentials to the new customer.
de_de: Dieses Plugin wurde entwickelt, um dir zu helfen ganz einfach neue Benutzer/Kunden anzulegen. Besonders nützlich ist dies, wenn der Kunde per Telefon oder E-Mail bestellt und du die Vorteile der Lager- und Auftragsverwaltung in WooCommerce nutzen möchten. Es fügt ein einfaches Kontrollkästchen am Ende der Rechnungsadresse hinzu. Wenn das Kästchen angewählt ist, wird ein neuer Benutzer mit der Rolle "Kunde" angelegt. Wenn keine E-Mail-Adresse angeben ist, wird eine einzigartige E-Mail-Adresse für Sie erstellt. Z.B. firstname.lastname@your-site.com. Standardmäßig erhält der neu angelegte Kunde keine E-Mail zum erstellten Konto. Im Einstellungsmenü gibt es die Option die Email Benachrichtigungen zu aktivieren um die Anmeldedaten an den neuen Kunden zu senden.

source: Email received by the new customer.
de_de: Email, welche an den neuen Kunden gesendet wird.

source: The settings menu.
de_de: Das Einstellungen-Menu

source: Enjoy
de_de: Viel Spaß!

source: Activate the plugin through the ‚Plugins‘ screen in WordPress.
de_de: Aktiviere das Plugin unter dem Menüpunkt „Plugins“ in WordPress.

source: Upload the plugin files to the /wp-content/plugins/add-customer-for-woocommerce directory, or install the plugin through the WordPress plugins screen directly.
de_de: Lade die Plugin-Dateien in das Verzeichnis /wp-content/plugins/add-customer-for-woocommerce hoch oder installiere das Plugin direkt über die WordPress-Plugin-Ansicht.

source: If you like the Plugin, please leave some Stars or donate me a coffee. Thanks!
de_de: Wenn dir das Plugin gefällt, freue ich mich über eine 5 Stern Bewertung und du kannst mir auch gerne eine Kaffee spendieren. Danke!

source: The order after saving. A new customer was created and assigned to the order.
de_de: Nach dem speichern einer Bestellung wird der neue Kunde angelegt und der Bestellung zugeordnet.

source: The billing part of a new order. With the checkbox selected, it will create a new user.
de_de: In der Rechnungsadresse der neue Bestellung. Ist das Kontrollkästchen aktiviert, wird ein neuer Kunde angelegt.

source: Initial Version!
de_de: Erste Version

source: First and Last name gets saved to the user as well
de_de: Vor- und Nachname werden auch gepeichert

source: Sanitize input fields
de_de: Filtern der Formular-Feldern

source: Added comments and method description
de_de: Kommentare und Methoden Beschreibung

source: Feature complete Version
de_de: Funktional komplettierte Version

source: Removed debugger
de_de: Debugger entfernt

source: Added Option to select the checkbox by default
de_de: Option hinzugefügt um die Auswahlbox automatisch anzuwählen

source: Added Option to send user notification
de_de: Option für das senden der Benachrichtigung an den Kunden hinzugefügt

source: Added Option Menu
de_de: Einstellungsmenu hinzugefügt

source: Admin/Editor gets a message if the creation of the new user was not successful. Check error_log for details.
de_de: Admin/Bearbeiter erhält eine Nachricht, wenn die Erstellung des neuen Kunden nicht erfolgreich war. Prüfe das error_log für details.

source: Added new Language strings for de-DE and de-CH
de_de: Neue Übersetzungen für de-DE und de-CH wurden hinzugefügt.

source: Fixed: Error when the domain name is "localhost"
de_de: Behoben: Fehler wenn die Domain "localhost" ist

source: Fixed: Error when no first name and no last name was provided
de_de: Behoben: Fehler wenn kein Vor- und Nachname angegeben war

source: Error and success messages will be added to the Log of the Simple History Plugin
de_de: Fehler- und Erfolgsnachrichten werden im Log des Simple History Plugin gespeichert.

source: Error messages will be saved in the error_log
de_de: Fehlermeldungen werden im error_log gespeichert

source: Added Error logging
de_de: Fehleraufzeichnung hinzugefügt

source: Errors and notifications for the admin will now be displayed after saving the order
de_de: Fehler und Nachrichten werden nun für den Bearbeiter nach dem speichern der Bestellung sichtbar.

source: Added a second checkbox for customer notification
de_de: Zweite Auswahlbox für die Kundenbenachrichtigung hinzugefügt

source: Added support for custom billing and shipping fields
de_de: Unterstützung von eigenen Rechnungs- und Versandfeldern hinzugefügt.
